Create a list called 'employee_names', which should contain the following names:

Amy White

Jack Stewart

Richard Lauderdale

Sara Johnson

In [6]:
import pandas as pd;

In [7]:
employee_names = ['Amy White', 'Jack Stewart', 'Richart Lauderdale','Sara Johnson']

In [10]:
employee_names

['Amy White', 'Jack Stewart', 'Richart Lauderdale', 'Sara Johnson']

In [15]:
type(employee_names)

list

Convert the list employee_names into a Panda Series

In [48]:
employee_names_series = pd.Series(employee_names)

In [49]:
employee_names_series

0             Amy White
1          Jack Stewart
2    Richart Lauderdale
3          Sara Johnson
dtype: object

Add number index number to list. You can add row numbers to a series by setting a list of indeces as you create the series

pd.Series(employee_names,[0,1,2,3])

In [55]:
pd.Series(employee_names,[0,1,2,3])

0             Amy White
1          Jack Stewart
2    Richart Lauderdale
3          Sara Johnson
dtype: object

Add dynamic index as row number

In [58]:
pd.Series(employee_names, range(1, len(employee_names)+1))

1             Amy White
2          Jack Stewart
3    Richart Lauderdale
4          Sara Johnson
dtype: object

Create a series directly

In [60]:
work_experience = pd.Series([5,8,3,10])

In [61]:
work_experience

0     5
1     8
2     3
3    10
dtype: int64

create a numpy array

In [65]:
import numpy as np;

In [70]:
array_1 =[50,53,35,43]

In [76]:
array_age = np.array(array_1)

In [77]:
array_age

array([50, 53, 35, 43])

In [79]:
age_series = pd.Series(array_age)

In [80]:
age_series

0    50
1    53
2    35
3    43
dtype: int64

access series attributes

In [81]:
age_series.dtype

dtype('int64')

age_series.size

In [83]:
age_series.size

4

In [84]:
age_series.name = "age_series_name"

In [85]:
age_series

0    50
1    53
2    35
3    43
Name: age_series_name, dtype: int64

age_series.name

Convert Series to numpy array

In [89]:
age_series.to_numpy()

array([50, 53, 35, 43])

In [93]:
print(type(age_series.to_numpy()))

<class 'numpy.ndarray'>

In [102]:
work_experience.name = "Work Experience (Yrs.)"

Prices Per Category Dictionary to a Series

In [97]:
prices_per_category = {'Product A' : 22250, 'Product B' : 16600, 'Product C' : 15600}

In [98]:
prices_per_category

{'Product A': 22250, 'Product B': 16600, 'Product C': 15600}

In [100]:
category_series = pd.Series(prices_per_category)

In [101]:
category_series

Product A    22250
Product B    16600
Product C    15600
dtype: int64

In [113]:
type(category_series.index)

pandas.core.indexes.base.Index

Accessing indexes

In [107]:
category_series["Product B"]

16600

In [109]:
category_series["Product A"]

22250

In [110]:
category_series[0]

22250

In [111]:
category_series[2]

15600

In [115]:
workers_age = {'Amy White' : 40, 'Jack Stewart' : 53, 'Richard Lauderdale' : 35, 'Sara Johnson' : 43}

In [117]:
workers_age

{'Amy White': 40,
 'Jack Stewart': 53,
 'Richard Lauderdale': 35,
 'Sara Johnson': 43}

In [119]:
workers_age_series = pd.Series(workers_age)

In [121]:
workers_age_series

Amy White             40
Jack Stewart          53
Richard Lauderdale    35
Sara Johnson          43
dtype: int64

In [122]:
workers_age_series.index

Index(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], dtype='object')

In [126]:
workers_age_series.index

Index(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], dtype='object')

In [127]:
type(workers_age_series.index)

pandas.core.indexes.base.Index

In [129]:
employees_work_exp = pd.Series({"Martin" : 8, "George" : 5})

In [132]:
print(employees_work_exp)

Martin    8
George    5
dtype: int64

In [135]:
employees_work_exp[0]

8

In [137]:
age_array = np.array([44,54,65,35])

In [139]:
series_age = pd.Series(age_array)

In [140]:
series_age

0    44
1    54
2    65
3    35
dtype: int64

Functions

In [141]:
series_age.sum()

198

In [142]:
series_age.min()

35

In [143]:
series_age.max()

65

In [146]:
employees_work_exp.idxmax()

'Martin'

In [149]:
series_age.idxmax()

2

above shows the index of the highest value in collection (idxmax)

In [148]:
series_age.idxmin()

3

shows minimum value of the collection/series age

pandas non-mathematical methods

head(N) = will return the first (N) data of the series

In [150]:
series_age.head(2)

0    44
1    54
dtype: int64

In [151]:
series_age.tail(2)

2    65
3    35
dtype: int64

In [152]:
employees_work_exp = pd.Series({
'Amy White'   : 3,
'Jack Stewart'   : 5,
'Richard Lauderdale'  : 4.5,
'Sara Johnson'  : 22,
'Patrick Adams' : 28,
'Jessica Baker'  : 14,
'Peter Hunt'   : 4,
'Daniel Lloyd'  : 6,
'John Owen'   : 1.5,
'Jennifer Phillips'  : 10,
'Courtney Rogers'   : 4.5,
'Anne Robinson'  : 2,
})

In [153]:
print(employees_work_exp)

Amy White              3.0
Jack Stewart           5.0
Richard Lauderdale     4.5
Sara Johnson          22.0
Patrick Adams         28.0
Jessica Baker         14.0
Peter Hunt             4.0
Daniel Lloyd           6.0
John Owen              1.5
Jennifer Phillips     10.0
Courtney Rogers        4.5
Anne Robinson          2.0
dtype: float64

In [154]:
print(employees_work_exp.head())

Amy White              3.0
Jack Stewart           5.0
Richard Lauderdale     4.5
Sara Johnson          22.0
Patrick Adams         28.0
dtype: float64

employees_work_exp.tail()

In [160]:
data = {'Name':['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'],'Age':[50,53,35,43],'Working Experience (Yrs.)':[5,8,3,10]}
df = pd.DataFrame(data);
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

ON data frames, Dictionary indexes are column names and their datas are row

In [164]:
type(data)

list

Creating Data frames using list

In [162]:

data = [{'Name' :'Amy White','Age':50,'Working Experience (Yrs.)':5},
        {'Name' :'Jack Stewart','Age':53,'Working Experience (Yrs.)':8},
        {'Name' :'Richard Lauderdale','Age':35,'Working Experience (Yrs.)':3},
        {'Name' :'Sara Johnson','Age':43,'Working Experience (Yrs.)':10}]

In [163]:
type(data)

list

In [165]:
df = pd.DataFrame(data)

In [166]:
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

Data frames can be created via
#1 : Dictionary of lists
#2 : Dictionar of lists + specifying an index
#3 : list of dictionaries
#4 : dictionary of panda series

In [167]:
df = pd.DataFrame(data, index=['A','B','C','D'])

In [168]:
df

                 Name  Age  Working Experience (Yrs.)
A           Amy White   50                          5
B        Jack Stewart   53                          8
C  Richard Lauderdale   35                          3
D        Sara Johnson   43                         10

In [172]:
df.columns

Index(['Name', 'Age', 'Working Experience (Yrs.)'], dtype='object')

In [174]:
df.shape

(4, 3)

In [175]:
df.iloc[[3]]

           Name  Age  Working Experience (Yrs.)
D  Sara Johnson   43                         10

In [177]:
df.iloc[[3,0]]

           Name  Age  Working Experience (Yrs.)
D  Sara Johnson   43                         10
A     Amy White   50                          5

In [179]:
df.index=[1,2,3,4]

In [180]:
df

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10